---
kind: other
id: Methods.T:Autodesk.Revit.DB.PrintSetting
source: html/0e05163e-a4fb-dd41-4582-7e383037d24f.htm
---
# PrintSetting Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.